-- MySQL dump 10.13  Distrib 8.0.46, for Linux (x86_64)
--
-- Host: localhost    Database: library_db
-- ------------------------------------------------------
-- Server version	8.0.46

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `library_db`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `library_db` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `library_db`;

--
-- Table structure for table `admins`
--

DROP TABLE IF EXISTS `admins`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admins` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(80) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password_hash` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(120) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_login` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admins`
--

LOCK TABLES `admins` WRITE;
/*!40000 ALTER TABLE `admins` DISABLE KEYS */;
INSERT INTO `admins` VALUES (1,'admin','scrypt:32768:8:1$GBAYwnpfZsM9jZt2$0689c72775e54b57ae32a3272405cb79285a3f7a367141f4c3f2c0179b3bfc23e9aacaec91bf03506a97d468128bb056cb06359b5afd6b9f023e21a83fa220e5','admin@library.com',NULL);
/*!40000 ALTER TABLE `admins` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `books` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(200) COLLATE utf8mb4_unicode_ci NOT NULL,
  `author` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `isbn` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `publisher` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `location` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `category` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `stock` int DEFAULT NULL,
  `total` int DEFAULT NULL,
  `borrow_count` int NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `ix_books_isbn` (`isbn`),
  KEY `ix_books_author` (`author`),
  KEY `ix_books_category` (`category`),
  KEY `ix_books_title` (`title`),
  KEY `ix_books_borrow_count` (`borrow_count`)
) ENGINE=InnoDB AUTO_INCREMENT=327 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (1,'深入理解计算机系统','Randal E. Bryant','9787111544937','机械工业出版社','二楼-A区-3书架-2层','计算机科学',12,12,8,NULL),(2,'算法导论','Thomas H. Cormen','9787111407010','机械工业出版社','一楼-B区-5书架-4层','算法与数据结构',10,10,15,NULL),(3,'计算机程序的构造和解释','Harold Abelson','9787111109758','机械工业出版社','三楼-C区-2书架-1层','计算机科学',8,8,22,NULL),(4,'编译原理','Alfred V. Aho','9787111253686','机械工业出版社','四楼-A区-4书架-3层','计算机科学',7,7,29,NULL),(5,'计算机网络','Andrew S. Tanenbaum','9787111453865','清华大学出版社','二楼-B区-1书架-5层','网络技术',9,9,36,NULL),(6,'C++ Primer','Stanley B. Lippman','9787121155356','电子工业出版社','一楼-C区-3书架-2层','编程语言',11,11,6,NULL),(7,'Effective C++','Scott Meyers','9787121123324','电子工业出版社','三楼-A区-5书架-4层','编程语言',8,8,13,NULL),(8,'Java核心技术 卷I','Cay S. Horstmann','9787111557913','机械工业出版社','四楼-B区-2书架-1层','编程语言',13,13,20,NULL),(9,'Python编程：从入门到实践','Eric Matthes','9787115428028','人民邮电出版社','二楼-C区-4书架-3层','编程语言',14,15,27,NULL),(10,'JavaScript高级程序设计','Nicholas C. Zakas','9787115275790','人民邮电出版社','一楼-A区-1书架-5层','编程语言',12,12,34,NULL),(11,'Go语言圣经','Alan A. A. Donovan','9787111558422','机械工业出版社','三楼-B区-3书架-2层','编程语言',9,9,4,NULL),(12,'Rust权威指南','Steve Klabnik','9787115527846','人民邮电出版社','四楼-C区-5书架-4层','编程语言',7,7,11,NULL),(13,'代码大全','Steve McConnell','9787121022095','电子工业出版社','二楼-A区-2书架-1层','软件工程',10,10,18,NULL),(14,'重构：改善既有代码的设计','Martin Fowler','9787115507992','人民邮电出版社','一楼-B区-4书架-3层','软件工程',11,11,25,NULL),(15,'设计模式','Erich Gamma','9787111211167','机械工业出版社','三楼-C区-1书架-5层','软件工程',9,9,32,NULL),(16,'代码整洁之道','Robert C. Martin','9787115216878','人民邮电出版社','四楼-A区-3书架-2层','软件工程',14,14,2,NULL),(17,'敏捷软件开发','Robert C. Martin','9787302080299','清华大学出版社','二楼-B区-5书架-4层','软件工程',8,8,9,NULL),(18,'人月神话','Frederick P. Brooks Jr.','9787302066231','清华大学出版社','一楼-C区-2书架-1层','软件工程',6,6,16,NULL),(19,'领域驱动设计','Eric Evans','9787115224491','人民邮电出版社','三楼-A区-4书架-3层','架构设计',7,7,23,NULL),(20,'企业应用架构模式','Martin Fowler','9787111148944','机械工业出版社','四楼-B区-1书架-5层','架构设计',8,8,30,NULL),(21,'微服务设计','Sam Newman','9787115419156','人民邮电出版社','二楼-C区-3书架-2层','架构设计',10,10,37,NULL),(22,'凤凰架构','周志明','9787111684926','机械工业出版社','一楼-A区-5书架-4层','架构设计',12,12,7,NULL),(23,'高性能MySQL','Baron Schwartz','9787121198854','电子工业出版社','三楼-B区-2书架-1层','数据库',11,11,14,NULL),(24,'Redis设计与实现','黄健宏','9787111464747','机械工业出版社','四楼-C区-4书架-3层','数据库',9,9,21,NULL),(25,'MongoDB权威指南','Kristina Chodorow','9787115327970','人民邮电出版社','二楼-A区-1书架-5层','数据库',7,7,28,NULL),(26,'数据库系统概念','Abraham Silberschatz','9787111394365','机械工业出版社','一楼-B区-3书架-2层','数据库',8,8,35,NULL),(27,'深度学习','Ian Goodfellow','9787115485700','人民邮电出版社','三楼-C区-5书架-4层','人工智能',13,13,5,NULL),(28,'机器学习','周志华','9787111547969','清华大学出版社','四楼-A区-2书架-1层','机器学习',14,14,12,NULL),(29,'统计学习方法','李航','9787302275954','清华大学出版社','二楼-B区-4书架-3层','机器学习',12,12,19,NULL),(30,'Python机器学习','Sebastian Raschka','9787111561590','机械工业出版社','一楼-C区-1书架-5层','机器学习',10,10,26,NULL),(31,'动手学深度学习','阿斯顿·张','9787115540713','人民邮电出版社','三楼-A区-3书架-2层','深度学习',11,11,33,NULL),(32,'你不知道的JavaScript','Kyle Simpson','9787115385734','人民邮电出版社','四楼-B区-5书架-4层','前端开发',9,9,3,NULL),(33,'JavaScript权威指南','David Flanagan','9787111378709','机械工业出版社','二楼-C区-2书架-1层','前端开发',8,8,10,NULL),(34,'Vue.js设计与实现','霍春阳','9787115589255','人民邮电出版社','一楼-A区-4书架-3层','前端开发',13,13,17,NULL),(35,'React进阶之路','徐超','9787115476029','人民邮电出版社','三楼-B区-1书架-5层','前端开发',10,10,24,NULL),(36,'CSS权威指南','Eric A. Meyer','9787121352089','电子工业出版社','四楼-C区-3书架-2层','前端开发',7,7,31,NULL),(37,'Spring实战','Craig Walls','9787115417947','人民邮电出版社','二楼-A区-5书架-4层','后端开发',12,12,1,NULL),(38,'Spring Boot编程思想','小马哥','9787121362811','电子工业出版社','一楼-B区-2书架-1层','后端开发',11,11,8,NULL),(39,'深入理解Java虚拟机','周志明','9787111641957','机械工业出版社','三楼-C区-4书架-3层','后端开发',14,14,15,NULL),(40,'Effective Java','Joshua Bloch','9787111612728','机械工业出版社','四楼-A区-1书架-5层','后端开发',10,10,22,NULL),(41,'Android编程权威指南','Bill Phillips','9787115459282','人民邮电出版社','二楼-B区-3书架-2层','移动开发',8,8,29,NULL),(42,'iOS编程','Christian Keur','9787115446442','人民邮电出版社','一楼-C区-5书架-4层','移动开发',7,7,36,NULL),(43,'Flutter实战','杜文','9787115517913','人民邮电出版社','三楼-A区-2书架-1层','移动开发',9,9,6,NULL),(44,'Kotlin实战','Dmitry Jemerov','9787115476609','人民邮电出版社','四楼-B区-4书架-3层','移动开发',8,8,13,NULL),(45,'Kubernetes权威指南','龚正','9787121359583','电子工业出版社','二楼-C区-1书架-5层','云计算',10,10,20,NULL),(46,'Docker技术入门与实战','杨保华','9787111555827','机械工业出版社','一楼-A区-3书架-2层','云计算',11,11,27,NULL),(47,'Hadoop权威指南','Tom White','9787121231063','电子工业出版社','三楼-B区-5书架-4层','大数据',9,9,34,NULL),(48,'Spark快速大数据分析','Holden Karau','9787115374486','人民邮电出版社','四楼-C区-2书架-1层','大数据',8,8,4,NULL),(49,'白帽子讲Web安全','吴翰清','9787121176326','电子工业出版社','二楼-A区-4书架-3层','网络安全',12,12,11,NULL),(50,'Web安全深度剖析','张炳帅','9787121240980','电子工业出版社','一楼-B区-1书架-5层','网络安全',10,10,18,NULL),(51,'黑客攻防技术宝典','Dafydd Stuttard','9787115281975','人民邮电出版社','三楼-C区-3书架-2层','网络安全',9,9,25,NULL),(52,'密码学原理与实践','Douglas R. Stinson','9787121133862','电子工业出版社','四楼-A区-5书架-4层','网络安全',7,7,32,NULL),(53,'深入理解Linux内核','Daniel P. Bovet','9787508341866','中国电力出版社','二楼-B区-2书架-1层','操作系统',8,8,2,NULL),(54,'Linux内核设计与实现','Robert Love','9787111407065','机械工业出版社','一楼-C区-4书架-3层','操作系统',9,9,9,NULL),(55,'操作系统概念','Abraham Silberschatz','9787040375497','高等教育出版社','三楼-A区-1书架-5层','操作系统',11,11,16,NULL),(56,'现代操作系统','Andrew S. Tanenbaum','9787111549451','机械工业出版社','四楼-B区-3书架-2层','操作系统',10,10,23,NULL),(57,'活着','余华','9787506349161','作家出版社','二楼-C区-5书架-4层','文学小说',13,13,30,NULL),(58,'平凡的世界','路遥','9787530214862','北京十月文艺出版社','一楼-A区-2书架-1层','文学小说',15,15,37,NULL),(59,'白夜行','东野圭吾','9787544244831','南海出版公司','三楼-B区-4书架-3层','文学小说',12,12,7,NULL),(60,'解忧杂货店','东野圭吾','9787544254021','南海出版公司','四楼-C区-1书架-5层','文学小说',14,14,14,NULL),(61,'三体','刘慈欣','9787536692930','重庆出版社','二楼-A区-3书架-2层','文学小说',11,11,21,NULL),(62,'百年孤独','加西亚·马尔克斯','9787544743488','南海出版公司','一楼-B区-5书架-4层','文学小说',10,10,28,NULL),(63,'追风筝的人','卡勒德·胡赛尼','9787208061163','上海人民出版社','三楼-C区-2书架-1层','文学小说',9,9,35,NULL),(64,'小王子','圣埃克苏佩里','9787544735025','人民文学出版社','四楼-A区-4书架-3层','文学小说',8,8,5,NULL),(65,'围城','钱钟书','9787020027149','人民文学出版社','二楼-B区-1书架-5层','文学小说',7,7,12,NULL),(66,'红楼梦','曹雪芹','9787020081745','人民文学出版社','一楼-C区-3书架-2层','文学小说',12,12,19,NULL),(67,'经济学原理','N.格里高利·曼昆','9787301191743','北京大学出版社','三楼-A区-5书架-4层','经济管理',11,11,26,NULL),(68,'金字塔原理','芭芭拉·明托','9787544228947','南海出版公司','四楼-B区-2书架-1层','经济管理',9,9,33,NULL),(69,'从0到1','彼得·蒂尔','9787508648040','中信出版社','二楼-C区-4书架-3层','经济管理',13,13,3,NULL),(70,'创新者的窘境','克莱顿·克里斯坦森','9787508625188','中信出版社','一楼-A区-1书架-5层','经济管理',10,10,10,NULL),(71,'精益创业','埃里克·莱斯','9787508635064','中信出版社','三楼-B区-3书架-2层','经济管理',8,8,17,NULL),(72,'增长黑客','肖恩·埃利斯','9787508656984','中信出版社','四楼-C区-5书架-4层','经济管理',7,7,24,NULL),(73,'黑客与画家','Paul Graham','9787115249494','人民邮电出版社','二楼-A区-2书架-1层','个人成长',12,12,31,NULL),(74,'程序员修炼之道','Andrew Hunt','9787115219039','人民邮电出版社','一楼-B区-4书架-3层','个人成长',11,11,1,NULL),(75,'软技能','John Sonmez','9787115429452','人民邮电出版社','三楼-C区-1书架-5层','个人成长',10,10,8,NULL),(76,'高效能人士的七个习惯','史蒂芬·柯维','9787508623207','中信出版社','四楼-A区-3书架-2层','个人成长',14,14,15,NULL),(77,'思考，快与慢','丹尼尔·卡尼曼','9787508634647','中信出版社','二楼-B区-5书架-4层','个人成长',13,13,22,NULL),(78,'影响力','罗伯特·西奥迪尼','9787508648446','中信出版社','一楼-C区-2书架-1层','个人成长',12,12,29,NULL),(79,'原则','瑞·达利欧','9787508680972','中信出版社','三楼-A区-4书架-3层','个人成长',15,15,36,NULL),(80,'刻意练习','安德斯·艾利克森','9787111557678','机械工业出版社','四楼-B区-1书架-5层','个人成长',11,11,6,NULL),(81,'认知觉醒','周岭','9787115546531','人民邮电出版社','二楼-C区-3书架-2层','个人成长',9,9,13,NULL),(82,'终身成长','卡罗尔·德韦克','9787559614575','江西人民出版社','一楼-A区-5书架-4层','个人成长',8,8,20,NULL),(83,'刀剑神域','川原砾','9787534280917','湖南美术出版社','三楼-B区-2书架-1层','二次元',10,10,27,NULL),(84,'魔法禁书目录','镰池和马','9787534268908','湖南美术出版社','四楼-C区-4书架-3层','二次元',9,9,34,NULL),(85,'我的青春恋爱物语果然有问题','渡航','9787534282447','安徽少年儿童出版社','二楼-A区-1书架-5层','二次元',11,11,4,NULL),(86,'约会大作战','橘公司','9787534279546','湖南美术出版社','一楼-B区-3书架-2层','二次元',8,8,11,NULL),(87,'Re:从零开始的异世界生活','长月达平','9787534291234','台海出版社','三楼-C区-5书架-4层','二次元',12,12,18,NULL),(88,'关于我转生变成史莱姆这档事','伏瀬','9787534295678','安徽少年儿童出版社','四楼-A区-2书架-1层','二次元',13,13,25,NULL),(89,'无职转生','理不尽な孫の手','9787534298765','台海出版社','二楼-B区-4书架-3层','二次元',10,10,32,NULL),(90,'overlord','丸山くがね','9787534287654','新星出版社','一楼-C区-1书架-5层','二次元',9,9,2,NULL),(91,'为美好的世界献上祝福','晓なつめ','9787534283456','云南美术出版社','三楼-A区-3书架-2层','二次元',11,11,9,NULL),(92,'青春猪头少年不会梦到兔女郎学姐','鸭志田一','9787534289012','湖南美术出版社','四楼-B区-5书架-4层','二次元',14,14,16,NULL),(93,'物语系列','西尾维新','9787544258968','人民文学出版社','二楼-C区-2书架-1层','二次元',12,12,23,NULL),(94,'凉宫春日系列','谷川流','9787534267123','上海译文出版社','一楼-A区-4书架-3层','二次元',10,10,30,NULL),(95,'狼与香辛料','支倉凍砂','9787534275432','南海出版公司','三楼-B区-1书架-5层','二次元',8,8,37,NULL),(96,'文学少女','野村美月','9787534269876','人民文学出版社','四楼-C区-3书架-2层','二次元',7,7,7,NULL),(97,'樱花庄的宠物女孩','鸭志田一','9787534281234','湖南美术出版社','二楼-A区-5书架-4层','二次元',9,9,14,NULL),(98,'崩坏三','米哈游','9787532155705','米哈游','二楼-B区-3书架-2层','二次元',5,5,5,NULL),(99,'三体','刘慈欣','9787229030933','重庆出版社','三楼-A区-2书架-1层','科幻',5,5,19,NULL),(100,'活着','余华','9787506365437','作家出版社','四楼-B区-4书架-3层','文学',5,5,26,NULL),(101,'经济学原理','曼昆','9787301208274','北京大学出版社','二楼-C区-1书架-5层','经济',5,5,33,NULL),(102,'心理学与生活','理查德·格里格','9787111531671','人民邮电出版社','一楼-A区-3书架-2层','心理',5,5,3,NULL),(103,'数据结构','严蔚敏','9787302575864','清华大学出版社','三楼-B区-5书架-4层','计算机基础',9,9,10,NULL),(104,'离散数学及其应用','Kenneth H.Rosen','9787111642121','机械工业出版社','四楼-C区-2书架-1层','计算机基础',8,8,17,NULL),(105,'组合数学','布鲁迪','9787111680904','机械工业出版社','二楼-A区-4书架-3层','计算机基础',7,7,24,NULL),(106,'计算机组成原理','唐朔飞','9787040453979','高等教育出版社','一楼-B区-1书架-5层','计算机基础',10,10,31,NULL),(107,'微机原理与接口技术','周明德','9787115532019','人民邮电出版社','三楼-C区-3书架-2层','计算机基础',6,6,1,NULL),(108,'嵌入式系统导论','韦东山','9787115562344','人民邮电出版社','四楼-A区-5书架-4层','嵌入式开发',11,11,8,NULL),(109,'物联网技术概论','王健','9787115571438','人民邮电出版社','二楼-B区-2书架-1层','物联网',9,9,15,NULL),(110,'工业互联网实战','李伯虎','9787111692304','机械工业出版社','一楼-C区-4书架-3层','物联网',8,8,22,NULL),(111,'数字信号处理','陈后金','9787040509213','高等教育出版社','三楼-A区-1书架-5层','电子信息',7,7,29,NULL),(112,'通信原理','樊昌信','9787115543684','人民邮电出版社','四楼-B区-3书架-2层','电子信息',10,10,36,NULL),(113,'C语言：现代方法','K.N. King','9787115566410','人民邮电出版社','二楼-C区-5书架-4层','编程语言',12,12,6,NULL),(114,'C和指针','肯尼斯·里科','9787115559986','人民邮电出版社','一楼-A区-2书架-1层','编程语言',9,9,13,NULL),(115,'C专家编程','彼得·范德林登','9787115559979','人民邮电出版社','三楼-B区-4书架-3层','编程语言',8,8,20,NULL),(116,'C陷阱与缺陷','安德鲁·凯尼格','9787115560012','人民邮电出版社','四楼-C区-1书架-5层','编程语言',7,7,27,NULL),(117,'C++编程思想 卷二','布鲁斯·埃克尔','9787111231227','机械工业出版社','二楼-A区-3书架-2层','编程语言',10,10,34,NULL),(118,'C++并发编程实战','安东尼·威廉姆斯','9787115558019','人民邮电出版社','一楼-B区-5书架-4层','编程语言',11,11,4,NULL),(119,'Qt 5开发实战','霍亚飞','9787115539673','人民邮电出版社','三楼-C区-2书架-1层','桌面开发',9,9,11,NULL),(120,'FFmpeg音视频开发','雷霄骅','9787115548638','人民邮电出版社','四楼-A区-4书架-3层','音视频开发',8,8,18,NULL),(121,'OpenCV计算机视觉','毛星云','9787115554059','人民邮电出版社','二楼-B区-1书架-5层','图像处理',10,10,25,NULL),(122,'CUDA并行程序设计','桑德斯','9787111645687','机械工业出版社','一楼-C区-3书架-2层','高性能计算',7,7,32,NULL),(123,'深入Java虚拟机','周明','9787115561125','人民邮电出版社','三楼-A区-5书架-4层','后端开发',12,12,2,NULL),(124,'Spring Cloud微服务','方志朋','9787115563310','人民邮电出版社','四楼-B区-2书架-1层','后端开发',13,13,9,NULL),(125,'MyBatis从入门到精通','刘增辉','9787115543646','人民邮电出版社','二楼-C区-4书架-3层','后端开发',10,10,16,NULL),(126,'RabbitMQ实战','王松','9787115551942','人民邮电出版社','一楼-A区-1书架-5层','中间件',9,9,23,NULL),(127,'RocketMQ技术内幕','丁超','9787111686730','机械工业出版社','三楼-B区-3书架-2层','中间件',8,8,30,NULL),(128,'Elasticsearch实战','郭睿','9787115547018','人民邮电出版社','四楼-C区-5书架-4层','搜索引擎',11,11,37,NULL),(129,'Lucene搜索引擎开发','牛长流','9787115521665','人民邮电出版社','二楼-A区-2书架-1层','搜索引擎',7,7,7,NULL),(130,'Netty权威指南','李林锋','9787115530220','人民邮电出版社','一楼-B区-4书架-3层','网络编程',10,10,14,NULL),(131,'Nacos微服务治理','小马哥','9787121399623','电子工业出版社','三楼-C区-1书架-5层','微服务',9,9,21,NULL),(132,'Sentinel流量控制','吴峻申','9787115568940','人民邮电出版社','四楼-A区-3书架-2层','微服务',8,8,28,NULL),(133,'Python高级编程','卢迦诺','9787115562122','人民邮电出版社','二楼-B区-5书架-4层','编程语言',11,11,35,NULL),(134,'Python高效编程','罗曼·马丁','9787115537311','人民邮电出版社','一楼-C区-2书架-1层','编程语言',9,9,5,NULL),(135,'PyQt6快速开发','王宇韬','9787115574621','人民邮电出版社','三楼-A区-4书架-3层','GUI开发',10,10,12,NULL),(136,'Pandas数据分析','乔纳森·金','9787115556817','人民邮电出版社','四楼-B区-1书架-5层','数据分析',12,12,19,NULL),(137,'Matplotlib数据可视化','邓云','9787115549010','人民邮电出版社','二楼-C区-3书架-2层','数据可视化',8,8,26,NULL),(138,'OpenCV-Python图像处理','李立宗','9787115564249','人民邮电出版社','一楼-A区-5书架-4层','人工智能',11,11,33,NULL),(139,'Selenium自动化测试','杨雪','9787115553120','人民邮电出版社','三楼-B区-2书架-1层','自动化测试',7,7,3,NULL),(140,'Playwright爬虫实战','陈智超','9787115581630','人民邮电出版社','四楼-C区-4书架-3层','爬虫开发',9,9,10,NULL),(141,'FastAPI后端开发','黄勇','9787115577615','人民邮电出版社','二楼-A区-1书架-5层','后端开发',10,10,17,NULL),(142,'Tornado高性能Web','邱雨','9787115528913','人民邮电出版社','一楼-B区-3书架-2层','后端开发',8,8,24,NULL),(143,'ES6标准入门','阮一峰','9787115491398','人民邮电出版社','三楼-C区-5书架-4层','前端开发',11,11,31,NULL),(144,'TypeScript编程','安德烈·梅佐斯','9787115565543','人民邮电出版社','四楼-A区-2书架-1层','前端开发',10,10,1,NULL),(145,'Vite实战指南','春日治','9787115586765','人民邮电出版社','二楼-B区-4书架-3层','前端开发',9,9,8,NULL),(146,'Nuxt3服务端渲染','陈屹','9787115591210','人民邮电出版社','一楼-C区-1书架-5层','前端开发',8,8,15,NULL),(147,'Tailwind CSS设计','亚当·斯科特','9787115579206','人民邮电出版社','三楼-A区-3书架-2层','前端开发',7,7,22,NULL),(148,'Webpack5模块化打包','吴浩麟','9787115567912','人民邮电出版社','四楼-B区-5书架-4层','工程化',10,10,29,NULL),(149,'前端工程化实战','杨寒','9787115557119','人民邮电出版社','二楼-C区-2书架-1层','工程化',9,9,36,NULL),(150,'Three.js 3D开发','李方捷','9787115545234','人民邮电出版社','一楼-A区-4书架-3层','可视化',11,11,6,NULL),(151,'WebGL图形编程','樊伟','9787115532903','人民邮电出版社','三楼-B区-1书架-5层','图形开发',8,8,13,NULL),(152,'跨端开发Flutter','王海涛','9787115566731','人民邮电出版社','四楼-C区-3书架-2层','跨端开发',10,10,20,NULL),(153,'SQL必知必会','本·福达','9787115531896','人民邮电出版社','二楼-A区-5书架-4层','数据库',9,9,27,NULL),(154,'SQL学习指南','安东尼·德巴里','9787115556503','人民邮电出版社','一楼-B区-2书架-1层','数据库',8,8,34,NULL),(155,'PostgreSQL高性能','格雷格·史密斯','9787115546425','人民邮电出版社','三楼-C区-4书架-3层','数据库',11,11,4,NULL),(156,'TiDB分布式数据库','黄东旭','9787111691949','机械工业出版社','四楼-A区-1书架-5层','数据库',10,10,11,NULL),(157,'ClickHouse大数据分析','朱凯','9787115570523','人民邮电出版社','二楼-B区-3书架-2层','时序数据库',9,9,18,NULL),(158,'InfluxDB时序存储','李柯','9787115559474','人民邮电出版社','一楼-C区-5书架-4层','时序数据库',7,7,25,NULL),(159,'Neo4j图数据库实战','张俊杰','9787115548144','人民邮电出版社','三楼-A区-2书架-1层','图数据库',8,8,32,NULL),(160,'数据库优化实战','美团技术团队','9787111678955','机械工业出版社','四楼-B区-4书架-3层','数据库优化',12,12,2,NULL),(161,'事务与锁详解','姜承尧','9787115524410','人民邮电出版社','二楼-C区-1书架-5层','数据库原理',10,10,9,NULL),(162,'openGauss内核解析','华为技术团队','9787115584334','人民邮电出版社','一楼-A区-3书架-2层','国产数据库',11,11,16,NULL),(163,'强化学习入门','萨顿','9787115545357','人民邮电出版社','三楼-B区-5书架-4层','人工智能',12,12,23,NULL),(164,'自然语言处理入门','何晗','9787115536215','人民邮电出版社','四楼-C区-2书架-1层','NLP',10,10,30,NULL),(165,'Transformer模型详解','刘群','9787115576328','人民邮电出版社','二楼-A区-4书架-3层','深度学习',13,13,37,NULL),(166,'大语言模型实战','李沐','9787115590022','人民邮电出版社','一楼-B区-1书架-5层','大模型',11,11,7,NULL),(167,'AIGC应用开发','王健飞','9787115592636','人民邮电出版社','三楼-C区-3书架-2层','生成式AI',9,9,14,NULL),(168,'数据挖掘概念与技术','韩家炜','9787111682229','机械工业出版社','四楼-A区-5书架-4层','大数据',10,10,21,NULL),(169,'数据仓库工具箱','拉尔夫·金博尔','9787115541438','人民邮电出版社','二楼-B区-2书架-1层','数仓建设',8,8,28,NULL),(170,'Flink实时计算','张利兵','9787115552727','人民邮电出版社','一楼-C区-4书架-3层','大数据计算',11,11,35,NULL),(171,'Hive数据仓库','周松','9787115534778','人民邮电出版社','三楼-A区-1书架-5层','大数据',9,9,5,NULL),(172,'数据治理实战','石凤良','9787111690645','机械工业出版社','四楼-B区-3书架-2层','数据管理',7,7,12,NULL),(173,'Linux高级运维','张伟','9787115544737','人民邮电出版社','二楼-C区-5书架-4层','运维',10,10,19,NULL),(174,'Shell脚本编程','杨健','9787115526711','人民邮电出版社','一楼-A区-2书架-1层','运维脚本',8,8,26,NULL),(175,'Ansible自动化运维','张浩','9787115538278','人民邮电出版社','三楼-B区-4书架-3层','自动化运维',9,9,33,NULL),(176,'Prometheus监控实战','赵鑫','9787115561606','人民邮电出版社','四楼-C区-1书架-5层','运维监控',11,11,3,NULL),(177,'Grafana可视化监控','陈磊','9787115569732','人民邮电出版社','二楼-A区-3书架-2层','运维监控',7,7,10,NULL),(178,'Istio服务网格','马若飞','9787115573470','人民邮电出版社','一楼-B区-5书架-4层','云原生',10,10,17,NULL),(179,'Helm包管理实战','李猛','9787115582712','人民邮电出版社','三楼-C区-2书架-1层','云原生',8,8,24,NULL),(180,'容器安全攻防','王绍斌','9787115555279','人民邮电出版社','四楼-A区-4书架-3层','安全运维',9,9,31,NULL),(181,'公有云架构设计','阿里云团队','9787111684100','机械工业出版社','二楼-B区-1书架-5层','云计算',12,12,1,NULL),(182,'混合云建设实践','腾讯云团队','9787115571957','人民邮电出版社','一楼-C区-3书架-2层','云计算',10,10,8,NULL),(183,'Web漏洞攻防实战','余弦','9787115533245','人民邮电出版社','三楼-A区-5书架-4层','网络安全',11,11,15,NULL),(184,'内网安全攻防','徐焱','9787115540232','人民邮电出版社','四楼-B区-2书架-1层','渗透测试',10,10,22,NULL),(185,'代码审计实战','钟晨鸣','9787115550129','人民邮电出版社','二楼-C区-4书架-3层','安全开发',9,9,29,NULL),(186,'应急响应技术指南','安恒信息','9787115562788','人民邮电出版社','一楼-A区-1书架-5层','安全运维',8,8,36,NULL),(187,'威胁情报分析','奇安信团队','9787115572374','人民邮电出版社','三楼-B区-3书架-2层','网络安全',7,7,6,NULL),(188,'防火墙与安全策略','王清','9787115529644','人民邮电出版社','四楼-C区-5书架-4层','网络安全',9,9,13,NULL),(189,'VPN与加密通信','李刚','9787115531056','人民邮电出版社','二楼-A区-2书架-1层','网络安全',6,6,20,NULL),(190,'安卓逆向工程','吴玮','9787115542243','人民邮电出版社','一楼-B区-4书架-3层','逆向安全',10,10,27,NULL),(191,'iOS安全与逆向','周智','9787115551218','人民邮电出版社','三楼-C区-1书架-5层','逆向安全',8,8,34,NULL),(192,'区块链安全攻防','陈钟','9787115560432','人民邮电出版社','四楼-A区-3书架-2层','新型安全',9,9,4,NULL),(193,'软件测试实战','保罗·阿曼','9787115527111','人民邮电出版社','二楼-B区-5书架-4层','软件测试',10,10,11,NULL),(194,'自动化测试框架','温素剑','9787115535423','人民邮电出版社','一楼-C区-2书架-1层','自动化测试',9,9,18,NULL),(195,'性能测试从零开始','兰雯雯','9787115541987','人民邮电出版社','三楼-A区-4书架-3层','性能测试',8,8,25,NULL),(196,'接口测试实战','侯永杰','9787115549884','人民邮电出版社','四楼-B区-1书架-5层','接口测试',7,7,32,NULL),(197,'敏捷测试实践','丽莎·克里斯坦森','9787115552222','人民邮电出版社','二楼-C区-3书架-2层','测试管理',9,9,2,NULL),(198,'软件质量保障','朱少民','9787115520446','人民邮电出版社','一楼-A区-5书架-4层','质量管理',8,8,9,NULL),(199,'DevOps测试一体化','乐峰','9787115563907','人民邮电出版社','三楼-B区-2书架-1层','研发管理',11,11,16,NULL),(200,'单元测试最佳实践','王松','9787115530770','人民邮电出版社','四楼-C区-4书架-3层','代码测试',6,6,23,NULL),(201,'安全测试指南',' OWASP团队','9787115570110','人民邮电出版社','二楼-A区-1书架-5层','安全测试',10,10,30,NULL),(202,'持续集成与部署','王甲卫','9787115523222','人民邮电出版社','一楼-B区-3书架-2层','CI/CD',9,9,37,NULL),(203,'京华烟云','林语堂','9787508095615','华夏出版社','三楼-C区-5书架-4层','文学小说',12,12,7,NULL),(204,'边城','沈从文','9787020090014','人民文学出版社','二楼-B区-4书架-3层','文学小说',10,10,21,NULL),(205,'呼兰河传','萧红','9787020082209','人民文学出版社','一楼-C区-1书架-5层','文学小说',9,9,28,NULL),(206,'撒哈拉的故事','三毛','9787530214558','北京十月文艺出版社','三楼-A区-3书架-2层','文学散文',11,11,35,NULL),(207,'雨季不再来','三毛','9787530214565','北京十月文艺出版社','四楼-B区-5书架-4层','文学散文',8,8,5,NULL),(208,'局外人','加缪','9787544739726','译林出版社','二楼-C区-2书架-1层','外国文学',10,10,12,NULL),(209,'鼠疫','加缪','9787544739733','译林出版社','一楼-A区-4书架-3层','外国文学',9,9,19,NULL),(210,'变形记','卡夫卡','9787544738941','译林出版社','三楼-B区-1书架-5层','外国文学',7,7,26,NULL),(211,'雪国','川端康成','9787544739207','译林出版社','四楼-C区-3书架-2层','外国文学',11,11,33,NULL),(212,'祈祷落幕时','东野圭吾','9787544276645','南海出版公司','二楼-A区-5书架-4层','悬疑推理',12,12,3,NULL),(213,'假面饭店','东野圭吾','9787544268336','南海出版公司','一楼-B区-2书架-1层','悬疑推理',10,10,10,NULL),(214,'十日惊奇','奎因','9787513332345','新星出版社','三楼-C区-4书架-3层','悬疑推理',8,8,17,NULL),(215,'东方快车谋杀案','阿加莎','9787513326368','新星出版社','四楼-A区-1书架-5层','悬疑推理',11,11,24,NULL),(216,'尼罗河上的惨案','阿加莎','9787513326375','新星出版社','二楼-B区-3书架-2层','悬疑推理',9,9,31,NULL),(217,'无人生还','阿加莎','9787513326382','新星出版社','一楼-C区-5书架-4层','悬疑推理',10,10,1,NULL),(218,'告白','凑佳苗','9787544253987','南海出版公司','三楼-A区-2书架-1层','悬疑推理',8,8,8,NULL),(219,'模仿犯','宫部美雪','9787544259019','南海出版公司','四楼-B区-4书架-3层','悬疑推理',9,9,15,NULL),(220,'金色梦乡','伊坂幸太郎','9787544258127','南海出版公司','二楼-C区-1书架-5层','悬疑推理',11,11,22,NULL),(221,'死神的精确度','伊坂幸太郎','9787544253994','南海出版公司','一楼-A区-3书架-2层','悬疑推理',7,7,29,NULL),(222,'基地','阿西莫夫','9787539953516','江苏凤凰文艺出版社','三楼-B区-5书架-4层','科幻小说',12,12,36,NULL),(223,'银河帝国','阿西莫夫','9787539949618','江苏凤凰文艺出版社','四楼-C区-2书架-1层','科幻小说',13,13,6,NULL),(224,'三体X观想之宙','宝树','9787536694215','重庆出版社','二楼-A区-4书架-3层','科幻小说',9,9,13,NULL),(225,'球状闪电','刘慈欣','9787536689709','重庆出版社','一楼-B区-1书架-5层','科幻小说',10,10,20,NULL),(226,'超新星纪元','刘慈欣','9787536690507','重庆出版社','三楼-C区-3书架-2层','科幻小说',8,8,27,NULL),(227,'海伯利安','丹·西蒙斯','9787532752401','上海译文出版社','四楼-A区-5书架-4层','科幻小说',11,11,34,NULL),(228,'永恒的终结','阿西莫夫','9787539952205','江苏凤凰文艺出版社','二楼-B区-2书架-1层','科幻小说',9,9,4,NULL),(229,'美国众神','尼尔·盖曼','9787532752241','上海译文出版社','一楼-C区-4书架-3层','奇幻小说',10,10,11,NULL),(230,'乌有乡','尼尔·盖曼','9787532752258','上海译文出版社','三楼-A区-1书架-5层','奇幻小说',8,8,18,NULL),(231,'迷雾','斯蒂芬·金','9787020176771','人民文学出版社','四楼-B区-3书架-2层','奇幻悬疑',7,7,25,NULL),(232,'辉夜大小姐想让我告白','赤坂明','9787534087714','浙江人民美术出版社','二楼-C区-5书架-4层','二次元',10,10,32,NULL),(233,'五等分的新娘','春场葱','9787534085604','浙江人民美术出版社','一楼-A区-2书架-1层','二次元',9,9,2,NULL),(234,'堀与宫村','HERO','9787534086311','浙江人民美术出版社','三楼-B区-4书架-3层','二次元',8,8,9,NULL),(235,'擅长捉弄的高木同学','山本崇一朗','9787534084737','浙江人民美术出版社','四楼-C区-1书架-5层','二次元',7,7,16,NULL),(236,'平凡职业造就世界最强','白米良','9787550038126','百花洲文艺出版社','二楼-A区-3书架-2层','二次元',11,11,23,NULL),(237,'刺客守则','天城ケイ','9787550037648','百花洲文艺出版社','一楼-B区-5书架-4层','二次元',9,9,30,NULL),(238,'精灵幻想记','北山结莉','9787550039215','百花洲文艺出版社','三楼-C区-2书架-1层','二次元',10,10,37,NULL),(239,'回复术士的重启人生','月夜泪','9787550040136','百花洲文艺出版社','四楼-A区-4书架-3层','二次元',8,8,7,NULL),(240,'夏日重现','田中靖规','9787534088933','浙江人民美术出版社','二楼-B区-1书架-5层','二次元',12,12,14,NULL),(241,'葬送的芙莉莲','山田钟人','9787534090110','浙江人民美术出版社','一楼-C区-3书架-2层','二次元',11,11,21,NULL),(242,'街角魔族','伊藤いづも','9787534089619','浙江人民美术出版社','三楼-A区-5书架-4层','二次元',6,6,28,NULL),(243,'摇曳露营','あfろ','9787534089732','浙江人民美术出版社','四楼-B区-2书架-1层','二次元',7,7,35,NULL),(244,'碧蓝航线设定集','蛮啾网络','9787534090523','浙江人民美术出版社','二楼-C区-4书架-3层','二次元',9,9,5,NULL),(245,'崩坏：星穹铁道设定集','米哈游','9787532160129','上海文艺出版社','一楼-A区-1书架-5层','二次元',10,10,12,NULL),(246,'原神短篇漫画集','米哈游','9787534087950','浙江人民美术出版社','三楼-B区-3书架-2层','二次元',11,11,19,NULL),(247,'穷爸爸富爸爸','罗伯特·清崎','9787541152058','四川文艺出版社','四楼-C区-5书架-4层','经济理财',10,10,26,NULL),(248,'小狗钱钱','博多·舍费尔','9787521705845','中信出版社','二楼-A区-2书架-1层','经济理财',9,9,33,NULL),(249,'通往财富自由之路','李笑来','9787508663424','中信出版社','一楼-B区-4书架-3层','经济理财',11,11,3,NULL),(250,'随机漫步的傻瓜','塔勒布','9787508628318','中信出版社','三楼-C区-1书架-5层','经济思维',8,8,10,NULL),(251,'黑天鹅','塔勒布','9787508631158','中信出版社','四楼-A区-3书架-2层','经济思维',10,10,17,NULL),(252,'反脆弱','塔勒布','9787508635231','中信出版社','二楼-B区-5书架-4层','经济思维',12,12,24,NULL),(253,'牛奶可乐经济学','罗伯特·弗兰克','9787521729018','中信出版社','一楼-C区-2书架-1层','通俗经济',7,7,31,NULL),(254,'博弈论','纳什','9787111688321','机械工业出版社','三楼-A区-4书架-3层','经济理论',9,9,1,NULL),(255,'计量经济学基础','古扎拉蒂','9787300288015','中国人民大学出版社','四楼-B区-1书架-5层','经济学术',8,8,8,NULL),(256,'产业经济学','苏东水','9787040547309','高等教育出版社','二楼-C区-3书架-2层','经济学术',6,6,15,NULL),(257,'被拒绝的勇气','岸见一郎','9787111674919','机械工业出版社','一楼-A区-5书架-4层','心理学',10,10,22,NULL),(258,'自卑与超越','阿德勒','9787559636126','北京联合出版社','三楼-B区-2书架-1层','心理学',9,9,29,NULL),(259,'乌合之众：大众心理研究','勒庞','9787559624222','北京联合出版社','四楼-C区-4书架-3层','社会心理',8,8,36,NULL),(260,'亲密关系','罗兰·米勒','9787115548120','人民邮电出版社','二楼-A区-1书架-5层','社会心理',11,11,6,NULL),(261,'社会性动物','艾略特·阿伦森','9787115543141','人民邮电出版社','一楼-B区-3书架-2层','社会心理',10,10,13,NULL),(262,'自我决定理论','德西','9787521731639','中信出版社','三楼-C区-5书架-4层','成长心理',7,7,20,NULL),(263,'情绪钝感力','加藤谛三','9787559462558','江苏凤凰文艺出版社','四楼-A区-2书架-1层','情绪管理',9,9,27,NULL),(264,'钝感力','渡边淳一','9787555262315','青岛出版社','二楼-B区-4书架-3层','情绪管理',8,8,34,NULL),(265,'终身学习','野口悠纪雄','9787521729704','中信出版社','一楼-C区-1书架-5层','自我成长',10,10,4,NULL),(266,'认知突围','蔡垒磊','9787559608212','北京联合出版社','三楼-A区-3书架-2层','认知提升',9,9,11,NULL),(267,'中国通史','吕思勉','9787550021228','百花洲文艺出版社','四楼-B区-5书架-4层','历史人文',11,11,18,NULL),(268,'明朝那些事儿','当年明月','9787508097527','华夏出版社','二楼-C区-2书架-1层','通俗历史',12,12,25,NULL),(269,'万历十五年','黄仁宇','9787108009821','生活·读书·新知三联书店','一楼-A区-4书架-3层','历史随笔',10,10,32,NULL),(270,'人类文明简史','阿诺德·汤因比','9787521730649','中信出版社','三楼-B区-1书架-5层','世界历史',9,9,2,NULL),(271,'罗马人的故事','盐野七生','9787508095240','华夏出版社','四楼-C区-3书架-2层','世界历史',11,11,9,NULL),(272,'菊与刀','鲁思·本尼迪克特','9787559641939','北京联合出版社','二楼-A区-5书架-4层','文化研究',8,8,16,NULL),(273,'乡土中国','费孝通','9787100167895','商务印书馆','一楼-B区-2书架-1层','社会人文',7,7,23,NULL),(274,'江村经济','费孝通','9787100175626','商务印书馆','三楼-C区-4书架-3层','社会人文',6,6,30,NULL),(275,'中国大历史','黄仁宇','9787108010322','生活·读书·新知三联书店','四楼-A区-1书架-5层','历史研究',9,9,37,NULL),(276,'全球通史','斯塔夫里阿诺斯','9787301159026','北京大学出版社','二楼-B区-3书架-2层','世界通史',10,10,7,NULL),(277,'沉思录','马可·奥勒留','9787559633927','北京联合出版社','一楼-C区-5书架-4层','西方哲学',8,8,14,NULL),(278,'论人生','培根','9787559634016','北京联合出版社','三楼-A区-2书架-1层','西方哲学',7,7,21,NULL),(279,'理想国','柏拉图','9787100107564','商务印书馆','四楼-B区-4书架-3层','西方哲学',9,9,28,NULL),(280,'形而上学','亚里士多德','9787100124218','商务印书馆','二楼-C区-1书架-5层','西方哲学',6,6,35,NULL),(281,'道德经','老子','9787101136247','中华书局','一楼-A区-3书架-2层','中国哲学',10,10,5,NULL),(282,'论语译注','杨伯峻','9787101071012','中华书局','三楼-B区-5书架-4层','中国哲学',11,11,12,NULL),(283,'庄子今注今译','陈鼓应','9787101080229','中华书局','四楼-C区-2书架-1层','中国哲学',9,9,19,NULL),(284,'四书五经','朱熹','9787101156436','中华书局','二楼-A区-4书架-3层','国学经典',8,8,26,NULL),(285,'西方哲学史','罗素','9787100170355','商务印书馆','一楼-B区-1书架-5层','哲学通史',10,10,33,NULL),(286,'中国哲学简史','冯友兰','9787301213131','北京大学出版社','三楼-C区-3书架-2层','哲学简史',9,9,3,NULL),(287,'宇宙简史','霍金','9787535794124','湖南科学技术出版社','四楼-A区-5书架-4层','自然科普',10,10,10,NULL),(288,'万物理论','霍金','9787535794131','湖南科学技术出版社','二楼-B区-2书架-1层','自然科普',8,8,17,NULL),(289,'细胞生命的礼赞','刘易斯·托马斯','9787521705043','中信出版社','一楼-C区-4书架-3层','生物科普',7,7,24,NULL),(290,'自私的基因','道金斯','9787508694565','中信出版社','三楼-A区-1书架-5层','生物科普',9,9,31,NULL),(291,'枪炮、病菌与钢铁','贾雷德·戴蒙德','9787521718166','中信出版社','四楼-B区-3书架-2层','社科科普',11,11,1,NULL),(292,'生命是什么','薛定谔','9787521728950','中信出版社','二楼-C区-5书架-4层','科学随笔',8,8,8,NULL),(293,'时间的秩序','卡洛·罗韦利','9787521730632','中信出版社','一楼-A区-2书架-1层','物理科普',10,10,15,NULL),(294,'七堂极简物理课','卡洛·罗韦利','9787521705623','中信出版社','三楼-B区-4书架-3层','物理科普',6,6,22,NULL),(295,'迷人的材料','马克·米奥多尼克','9787521719811','中信出版社','四楼-C区-1书架-5层','物质科普',9,9,29,NULL),(296,'诗意的原子','科特·施塔格','9787521721203','中信出版社','二楼-A区-3书架-2层','化学科普',8,8,36,NULL),(297,'刑法学','高铭暄','9787301305300','北京大学出版社','一楼-B区-5书架-4层','法律专业',10,10,6,NULL),(298,'民法学','王利明','9787301308004','北京大学出版社','三楼-C区-2书架-1层','法律专业',9,9,13,NULL),(299,'法律常识一本全','春之霖','9787550247925','北京联合出版社','四楼-A区-4书架-3层','普法读物',7,7,20,NULL),(300,'社会契约论','卢梭','9787100115003','商务印书馆','二楼-B区-1书架-5层','政治法律',8,8,27,NULL),(301,'论法的精神','孟德斯鸠','9787100120432','商务印书馆','一楼-C区-3书架-2层','政治法律',9,9,34,NULL),(302,'大国治理','俞可平','9787521729100','中信出版社','三楼-A区-5书架-4层','社会治理',6,6,4,NULL),(303,'不平等的代价','斯蒂格利茨','9787521717725','中信出版社','四楼-B区-2书架-1层','社会研究',10,10,11,NULL),(304,'现代社会的诞生','罗伯特·海尔布隆纳','9787521731226','中信出版社','二楼-C区-4书架-3层','社会历史',8,8,18,NULL),(305,'法治的细节','罗翔','9787555917777','云南人民出版社','一楼-A区-1书架-5层','法律随笔',11,11,25,NULL),(306,'圆圈正义','罗翔','9787559645685','北京联合出版社','三楼-B区-3书架-2层','法律随笔',10,10,32,NULL),(307,'人体简史','比尔·布莱森','9787521723337','中信出版社','四楼-C区-5书架-4层','健康科普',10,10,2,NULL),(308,'睡眠革命','尼克·利特尔黑尔斯','9787559633422','北京联合出版社','二楼-A区-2书架-1层','健康养生',9,9,9,NULL),(309,'饮食的迷思','蒂姆·斯佩克特','9787521729605','中信出版社','一楼-B区-4书架-3层','健康饮食',8,8,16,NULL),(310,'运动改造大脑','约翰·瑞迪','9787521719453','中信出版社','三楼-C区-1书架-5层','身心健康',7,7,23,NULL),(311,'抑郁症自救手册','理查德·奥康纳','9787521730229','中信出版社','四楼-A区-3书架-2层','心理健康',9,9,30,NULL),(312,'基础护理学','李小妹','9787117281738','人民卫生出版社','二楼-B区-5书架-4层','医学专业',10,10,37,NULL),(313,'系统解剖学','柏树令','9787117267329','人民卫生出版社','一楼-C区-2书架-1层','医学专业',8,8,7,NULL),(314,'生理学','朱大年','9787117281691','人民卫生出版社','三楼-A区-4书架-3层','医学专业',6,6,14,NULL),(315,'中医基础理论','郑洪新','9787513269099','中国中医药出版社','四楼-B区-1书架-5层','中医养生',9,9,21,NULL),(316,'黄帝内经详解','王唯工','9787559642615','北京联合出版社','二楼-C区-3书架-2层','中医经典',8,8,28,NULL),(317,'艺术的故事','贡布里希','9787549413159','广西美术出版社','一楼-A区-5书架-4层','艺术通史',12,12,35,NULL),(318,'设计中的设计','原研哉','9787563392267','广西师范大学出版社','三楼-B区-2书架-1层','设计理论',10,10,5,NULL),(319,'点石成金','唐纳德·诺曼','9787115546870','人民邮电出版社','四楼-C区-4书架-3层','交互设计',9,9,12,NULL),(320,'简约至上','科尔伯恩','9787115545920','人民邮电出版社','二楼-A区-1书架-5层','UI设计',8,8,19,NULL),(321,'写给大家看的设计书','罗宾·威廉姆斯','9787115556367','人民邮电出版社','一楼-B区-3书架-2层','平面设计',7,7,26,NULL),(322,'色彩设计原理','原田玲仁','9787559637956','北京联合出版社','三楼-C区-5书架-4层','色彩美学',9,9,33,NULL),(323,'电影艺术','大卫·波德维尔','9787521727618','中信出版社','四楼-A区-2书架-1层','影视艺术',10,10,3,NULL),(324,'认识电影','路易斯·贾内梯','9787115544515','人民邮电出版社','二楼-B区-4书架-3层','影视艺术',8,8,10,NULL),(325,'音乐极简史','安德鲁·伯德','9787521730885','中信出版社','一楼-C区-1书架-5层','音乐艺术',6,6,17,NULL),(326,'摄影构图艺术','乔丹·德拉克','9787115539420','人民邮电出版社','三楼-A区-3书架-2层','摄影艺术',9,9,24,NULL);
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `borrow_records`
--

DROP TABLE IF EXISTS `borrow_records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `borrow_records` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `book_id` int NOT NULL,
  `borrow_date` datetime DEFAULT NULL,
  `return_date` datetime DEFAULT NULL,
  `pickup_date` datetime DEFAULT NULL,
  `reject_date` datetime DEFAULT NULL,
  `status` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `ix_borrow_records_user_id` (`user_id`),
  KEY `ix_borrow_records_book_id` (`book_id`),
  KEY `ix_borrow_records_borrow_date` (`borrow_date`),
  KEY `ix_borrow_records_status` (`status`),
  CONSTRAINT `borrow_records_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`),
  CONSTRAINT `borrow_records_ibfk_2` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `borrow_records`
--

LOCK TABLES `borrow_records` WRITE;
/*!40000 ALTER TABLE `borrow_records` DISABLE KEYS */;
INSERT INTO `borrow_records` VALUES (1,1,9,'2026-05-19 11:29:50',NULL,NULL,NULL,'pending');
/*!40000 ALTER TABLE `borrow_records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `login_history`
--

DROP TABLE IF EXISTS `login_history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `login_history` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `username_snapshot` varchar(80) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_type` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `login_time` datetime NOT NULL,
  `last_seen` datetime NOT NULL,
  `logout_time` datetime DEFAULT NULL,
  `is_online` tinyint(1) NOT NULL,
  `action` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `details` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `ix_login_history_user_id` (`user_id`),
  KEY `ix_login_history_is_online` (`is_online`),
  KEY `ix_login_history_username_snapshot` (`username_snapshot`),
  KEY `ix_login_history_action` (`action`),
  KEY `ix_login_history_last_seen` (`last_seen`),
  KEY `ix_login_history_login_time` (`login_time`),
  KEY `ix_login_history_user_type` (`user_type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `login_history`
--

LOCK TABLES `login_history` WRITE;
/*!40000 ALTER TABLE `login_history` DISABLE KEYS */;
/*!40000 ALTER TABLE `login_history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `online_sessions`
--

DROP TABLE IF EXISTS `online_sessions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `online_sessions` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `user_type` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `username` varchar(80) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `login_time` datetime NOT NULL,
  `last_seen` datetime NOT NULL,
  `login_history_id` int DEFAULT NULL,
  `is_kicked` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uq_online_session_user` (`user_id`,`user_type`),
  KEY `ix_online_sessions_is_kicked` (`is_kicked`),
  KEY `ix_online_sessions_user_type` (`user_type`),
  KEY `ix_online_sessions_last_seen` (`last_seen`),
  KEY `ix_online_sessions_user_id` (`user_id`),
  KEY `ix_online_sessions_login_history_id` (`login_history_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `online_sessions`
--

LOCK TABLES `online_sessions` WRITE;
/*!40000 ALTER TABLE `online_sessions` DISABLE KEYS */;
/*!40000 ALTER TABLE `online_sessions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(80) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password_hash` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(120) COLLATE utf8mb4_unicode_ci NOT NULL,
  `student_id` varchar(13) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `real_name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `class_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `avatar` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `banned_until` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `email` (`email`),
  UNIQUE KEY `student_id` (`student_id`),
  KEY `ix_users_banned_until` (`banned_until`),
  CONSTRAINT `student_id_digits` CHECK (((`student_id` is null) or regexp_like(`student_id`,_utf8mb4'^[0-9]{13}$')))
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'user1','scrypt:32768:8:1$1wZPCjEzPm6946Yn$4a544a8632ca89023fb9528b343758c6fc069d2e30093d96e49fc6154224b5181d3e689f28278d9aa4d0698b6d665823852329af5a10ed185cf4d4a0cea49098','user1@library.com','2021000000001','??','2024?????????1?',NULL,NULL);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `verification_codes`
--

DROP TABLE IF EXISTS `verification_codes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `verification_codes` (
  `id` int NOT NULL AUTO_INCREMENT,
  `email` varchar(120) COLLATE utf8mb4_unicode_ci NOT NULL,
  `code` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `expires_at` datetime NOT NULL,
  `created_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `ix_verification_codes_email` (`email`),
  KEY `ix_verification_codes_expires_at` (`expires_at`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `verification_codes`
--

LOCK TABLES `verification_codes` WRITE;
/*!40000 ALTER TABLE `verification_codes` DISABLE KEYS */;
INSERT INTO `verification_codes` VALUES (1,'3435255848@qq.com','653014','2026-05-19 13:41:54','2026-05-19 13:31:54');
/*!40000 ALTER TABLE `verification_codes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'library_db'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-19  5:34:00
